---
kind: other
id: Methods.T:Autodesk.Revit.DB.ElementDesignOptionFilter
source: html/2fa60011-4695-ee63-c8cc-d3786e73fcf3.htm
---
# ElementDesignOptionFilter Methods

Applies the filter to a given element.